In [117]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

A seires is a one-dimensional labeled array capable of holding any data type
Series Example:

In [118]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of the series shows the index (range index), followed by the values.
Because to index is specified a default index is given.

Below is a series with an index:

In [119]:
obj2 = pd.Series([4, 7, -5, 3], index=['a','b','c','d'])

obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [120]:
obj2 * 2

a     8
b    14
c   -10
d     6
dtype: int64

In [121]:
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

We can apply mathematical operations to series as seen above on obj2.

A series is like a fixed length ordered dictionary.
A dictionary can easily be converted to a series.
And vice versa.

In [122]:
np.mean(obj2)

2.25

Numpy funtions can be applied to series.

DataFrame is a two-dimensional labeled data structure with columns of potentially different types.

When making a dtataframe out of a dictionary, the keys become column names and the values become the data.

In [123]:
my_dict = {"name" : ["John", "Doe", "Jane"],
           "age" : np.array([25, 30, 28]),
           "weight" : (70, 80, 65),
           "height" : pd.Series([4.5, 5.0, 4.8], index = ["John", "Doe", "Jane"]),
           "siblings" : 1,
           "gender" : "M"}

df = pd.DataFrame(my_dict)

df

      name  age  weight  height  siblings gender
John  John   25      70     4.5         1      M
Doe    Doe   30      80     5.0         1      M
Jane  Jane   28      65     4.8         1      M

All for datatypes are capable of being stored in a DataFrame.
If one of you data columns is a pandas series that alredy has an index, pandas will use that index for the dataframe.

My_dict2 uses a list of height instead of a pandas series, it will also have a different index.

In [124]:
my_dict2 = {"name" : ["John", "Doe", "Jane"],
           "age" : np.array([25, 30, 28]),
           "weight" : (70, 80, 65),
           "height" : [4.5, 5.0, 4.8],
           "siblings" : 1,
           "gender" : "M"}

df2 = pd.DataFrame(my_dict2)

df2

   name  age  weight  height  siblings gender
0  John   25      70     4.5         1      M
1   Doe   30      80     5.0         1      M
2  Jane   28      65     4.8         1      M

In [125]:


df2 = pd.DataFrame(my_dict2, index = my_dict["name"])

df2

      name  age  weight  height  siblings gender
John  John   25      70     4.5         1      M
Doe    Doe   30      80     5.0         1      M
Jane  Jane   28      65     4.8         1      M

Df2 gets its index from the name column in my_dict.
Dataframes behave like a dictionary of Series objects that each have the same length and indices.

In [126]:
#Get a specific column by name
df2["weight"]

John    70
Doe     80
Jane    65
Name: weight, dtype: int64

In [127]:
#Get a specific column by name using dot notation
df2.weight

John    70
Doe     80
Jane    65
Name: weight, dtype: int64

In [128]:
#delete a column
del df2['name']

In [129]:
#Add a new column
df2["IQ"] = [130,105,115]
df2

      age  weight  height  siblings gender   IQ
John   25      70     4.5         1      M  130
Doe    30      80     5.0         1      M  105
Jane   28      65     4.8         1      M  115

Ensure that the new column has the same length as the DataFrame or else it will raise a ValueError or fill in all values with the same value if a single value is provided. An example is provided below:

In [130]:
df2["married"] = False

df2

      age  weight  height  siblings gender   IQ  married
John   25      70     4.5         1      M  130    False
Doe    30      80     5.0         1      M  105    False
Jane   28      65     4.8         1      M  115    False

In [131]:
df2["College"] = pd.Series(["Harvard"], index=["Jane"])

df2

      age  weight  height  siblings gender   IQ  married  College
John   25      70     4.5         1      M  130    False      NaN
Doe    30      80     5.0         1      M  105    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

When inserting a series into a DataFrame, rows are matched by index any missing index values will be filled with NaN.

You can select both rows or columns by label with df.loc[row_label, column_label] as seen below:

In [132]:
df2.loc["John"]

age            25
weight         70
height        4.5
siblings        1
gender          M
IQ            130
married     False
College       NaN
Name: John, dtype: object

In [133]:
df2.loc["John","IQ"]

130

In [134]:
df2.loc["John": "Doe", "IQ": "College"] #slice by rows and columns

       IQ  married College
John  130    False     NaN
Doe   105    False     NaN

You can also select rows or columns by position with df.iloc[row_index, column_] as seen below:
This is useful for locating row that were never explicitly labeled.

In [135]:
df2.iloc[0]

age            25
weight         70
height        4.5
siblings        1
gender          M
IQ            130
married     False
College       NaN
Name: John, dtype: object

In [136]:
df2.iloc[0:2, 5:8] #slice by rows and columns

       IQ  married College
John  130    False     NaN
Doe   105    False     NaN

In [137]:
booolean_index = [True, False, True] #this will only return rows where the boolean index is True
df2[booolean_index] #slice by rows based on a boolean index

      age  weight  height  siblings gender   IQ  married  College
John   25      70     4.5         1      M  130    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

Logical boolean indexing us useful for subsetting data based on certain conditions. For example to get all rows where the age is greater than 25:

In [138]:
boolean_index = df2["age"] > 25

df2[boolean_index]

      age  weight  height  siblings gender   IQ  married  College
Doe    30      80     5.0         1      M  105    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

You can do this all in one operation as seen below:

In [139]:
df2[df2["age"] > 25]

      age  weight  height  siblings gender   IQ  married  College
Doe    30      80     5.0         1      M  105    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

Exploring data

Most times when you get a dataframe, its not going to be something you made in python its going to be read from a file, or scraped from a website.

Your going to need to know some basic functions to explore your data.

In [140]:
titanic_train = pd.read_csv('titanic/train.csv')

type(titanic_train)

pandas.core.frame.DataFrame

Notice that titanic_train is a DataFrame.

In [141]:
titanic_train.shape     #shows dimensions of the dataframe

(891, 12)

In [142]:
titanic_train.head(6)     #shows the first 6 rows of the dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [153]:

titanic_train_clean = clean_data(titanic_train.copy())
titanic_train_clean.head()

/var/folders/20/24nsj1xx7y52k8m90_h_2r5h0000gp/T/ipykernel_19776/2062085257.py:11: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_train = titanic_train.groupby(['Age Group']).agg(Survived_mean=('Survived', 'mean')).reset_index()

          Age Group  Survived_mean
0    (0.34, 16.336]       0.550000
1  (16.336, 32.252]       0.344168
2  (32.252, 48.168]       0.404255
3  (48.168, 64.084]       0.434783
4    (64.084, 80.0]       0.090909

In [ ]:
titanic_train.tail(6)     #shows the last 6 rows of the dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

Head and tail are useful for getting a quick look at your data and seing what it looks like.

In [ ]:
titanic_train.index = titanic_train["Name"]
del titanic_train["Name"]

print(titanic_train.index[0:10])

Index(['Braund, Mr. Owen Harris',
       'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
       'Heikkinen, Miss. Laina',
       'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
       'Allen, Mr. William Henry', 'Moran, Mr. James',
       'McCarthy, Mr. Timothy J', 'Palsson, Master. Gosta Leonard',
       'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
       'Nasser, Mrs. Nicholas (Adele Achem)'],
      dtype='object', name='Name')

In [ ]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
titanic_train.describe() #summarize statistics for numerical columns

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Because dataframe columns are series and series are related to numpy arrays you can perform operations on them as you would on numpy arrays.

In [ ]:
# Select only the numeric columns
numeric_columns = titanic_train.select_dtypes(include=[np.number])

# Calculate the mean of the numeric columns
np.mean(numeric_columns, axis=0)

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [ ]:
titanic_train.info() #shows a concise summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, Braund, Mr. Owen Harris to Dooley, Mr. Patrick
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 83.5+ KB

In [152]:
"""
Cell generated by Data Wrangler.
"""
def clean_data(titanic_train):
    # Drop columns: 'PassengerId', 'Cabin'
    titanic_train = titanic_train.drop(columns=['PassengerId', 'Cabin'])
    # Replace missing values with the mean of each column in: 'Age'
    titanic_train = titanic_train.fillna({'Age': int(titanic_train['Age'].mean())})
    # Performed 1 aggregation grouped on column: 'Sex'
    titanic_train['Age Group'] = pd.cut(titanic_train['Age'], 5)
    titanic_train = titanic_train.groupby(['Age Group']).agg(Survived_mean=('Survived', 'mean')).reset_index()
    return titanic_train

clean_data(titanic_train.copy())

/var/folders/20/24nsj1xx7y52k8m90_h_2r5h0000gp/T/ipykernel_19776/2062085257.py:11: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_train = titanic_train.groupby(['Age Group']).agg(Survived_mean=('Survived', 'mean')).reset_index()

          Age Group  Survived_mean
0    (0.34, 16.336]       0.550000
1  (16.336, 32.252]       0.344168
2  (32.252, 48.168]       0.404255
3  (48.168, 64.084]       0.434783
4    (64.084, 80.0]       0.090909

Messed around with data wranger to create a function that cleaned and preprocessed data.
To reveal the mortality rate by age group, I've created a new column called 'Age Group' and averaged the 'Survived' column for each group.

In [150]:
clean_data(titanic_train.copy()).to_csv('titanic_age_survival.csv')

/var/folders/20/24nsj1xx7y52k8m90_h_2r5h0000gp/T/ipykernel_19776/1494559738.py:11: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic_train = titanic_train.groupby(['Age Group']).agg(Survived_mean=('Survived', 'mean')).reset_index()